# Operações Básicas
- 1. Criando um Dataframe
    - 1.1 Operações Básicas
    - 1.2 Criando Colunas
    - 1.3 Removendo Colunas
    - 1.4 Removendo Linhas
    - 1.5 Alterando valores
    - 1.6 Renomeando colunas de um dataframe 
    - 1.7 Modificando index
    - 1.8 Ordenando Dados
    - 1.9 Multiindex
<img src='https://pandas.pydata.org/docs/_images/05_newcolumn_1.svg'>

In [1]:
import pandas as pd
import numpy as np
from numpy.random import randn
np.random.seed(101)

## 1. Criando um DataFrame

In [2]:
df = pd.read_csv('data/sales_clear.csv')

In [3]:
df.head(5)

,Start_Date,Customer Number,Customer Name,2016,2017,Percent Growth,Jan Units,Active
0,2015-01-10,10002,Quest Industries,125000.0,162500.0,0.30,500.0,True
1,2014-06-15,552278,Smith Plumbing,920000.0,1012000.0,0.10,700.0,True
2,2016-03-29,23477,ACME Industrial,50000.0,62500.0,0.25,125.0,True
3,2015-10-27,24900,Brekke LTD,350000.0,490000.0,0.04,75.0,True
4,2014-02-02,651029,Harbor Co,15000.0,12750.0,-0.15,NaN,False

### 1.1 Operações Matemática

In [4]:
df['2016'] + df['2017']

0     287500.0
1    1932000.0
2     112500.0
3     840000.0
4      27750.0
dtype: float64

In [5]:
df['2016'] - df['2017']

0    -37500.0
1    -92000.0
2    -12500.0
3   -140000.0
4      2250.0
dtype: float64

In [6]:
df['2016'] / df['2017']

0    0.769231
1    0.909091
2    0.800000
3    0.714286
4    1.176471
dtype: float64

In [7]:
df['2016'] * df['2017']

0    2.031250e+10
1    9.310400e+11
2    3.125000e+09
3    1.715000e+11
4    1.912500e+08
dtype: float64

### 1.2 Criando uma coluna

In [8]:
df.head()

,Start_Date,Customer Number,Customer Name,2016,2017,Percent Growth,Jan Units,Active
0,2015-01-10,10002,Quest Industries,125000.0,162500.0,0.30,500.0,True
1,2014-06-15,552278,Smith Plumbing,920000.0,1012000.0,0.10,700.0,True
2,2016-03-29,23477,ACME Industrial,50000.0,62500.0,0.25,125.0,True
3,2015-10-27,24900,Brekke LTD,350000.0,490000.0,0.04,75.0,True
4,2014-02-02,651029,Harbor Co,15000.0,12750.0,-0.15,NaN,False

In [9]:
df['soma_2016_2017'] = df['2016'] + df['2017']

In [10]:
df.head()

,Start_Date,Customer Number,Customer Name,2016,2017,Percent Growth,Jan Units,Active,soma_2016_2017
0,2015-01-10,10002,Quest Industries,125000.0,162500.0,0.30,500.0,True,287500.0
1,2014-06-15,552278,Smith Plumbing,920000.0,1012000.0,0.10,700.0,True,1932000.0
2,2016-03-29,23477,ACME Industrial,50000.0,62500.0,0.25,125.0,True,112500.0
3,2015-10-27,24900,Brekke LTD,350000.0,490000.0,0.04,75.0,True,840000.0
4,2014-02-02,651029,Harbor Co,15000.0,12750.0,-0.15,NaN,False,27750.0

### 1.3 Removendo colunas

In [11]:
df.drop('soma_2016_2017', axis=1)

,Start_Date,Customer Number,Customer Name,2016,2017,Percent Growth,Jan Units,Active
0,2015-01-10,10002,Quest Industries,125000.0,162500.0,0.30,500.0,True
1,2014-06-15,552278,Smith Plumbing,920000.0,1012000.0,0.10,700.0,True
2,2016-03-29,23477,ACME Industrial,50000.0,62500.0,0.25,125.0,True
3,2015-10-27,24900,Brekke LTD,350000.0,490000.0,0.04,75.0,True
4,2014-02-02,651029,Harbor Co,15000.0,12750.0,-0.15,NaN,False

In [12]:
df.drop('soma_2016_2017', axis=1, inplace=True)

### 1.4 Removendo linhas

In [13]:
df.head()

,Start_Date,Customer Number,Customer Name,2016,2017,Percent Growth,Jan Units,Active
0,2015-01-10,10002,Quest Industries,125000.0,162500.0,0.30,500.0,True
1,2014-06-15,552278,Smith Plumbing,920000.0,1012000.0,0.10,700.0,True
2,2016-03-29,23477,ACME Industrial,50000.0,62500.0,0.25,125.0,True
3,2015-10-27,24900,Brekke LTD,350000.0,490000.0,0.04,75.0,True
4,2014-02-02,651029,Harbor Co,15000.0,12750.0,-0.15,NaN,False

In [14]:
#drop rows
df.drop([1,2], axis=0)

,Start_Date,Customer Number,Customer Name,2016,2017,Percent Growth,Jan Units,Active
0,2015-01-10,10002,Quest Industries,125000.0,162500.0,0.30,500.0,True
3,2015-10-27,24900,Brekke LTD,350000.0,490000.0,0.04,75.0,True
4,2014-02-02,651029,Harbor Co,15000.0,12750.0,-0.15,NaN,False

### 1.5 Alterando valores

In [15]:
df.loc[1:5, 'Jan Units']

1    700.0
2    125.0
3     75.0
4      NaN
Name: Jan Units, dtype: float64

In [16]:
df.loc[1:10, 'Jan Units'] = 0

In [17]:
df

,Start_Date,Customer Number,Customer Name,2016,2017,Percent Growth,Jan Units,Active
0,2015-01-10,10002,Quest Industries,125000.0,162500.0,0.30,500.0,True
1,2014-06-15,552278,Smith Plumbing,920000.0,1012000.0,0.10,0.0,True
2,2016-03-29,23477,ACME Industrial,50000.0,62500.0,0.25,0.0,True
3,2015-10-27,24900,Brekke LTD,350000.0,490000.0,0.04,0.0,True
4,2014-02-02,651029,Harbor Co,15000.0,12750.0,-0.15,0.0,False

### 1.6 Rename columns

In [18]:
df

,Start_Date,Customer Number,Customer Name,2016,2017,Percent Growth,Jan Units,Active
0,2015-01-10,10002,Quest Industries,125000.0,162500.0,0.30,500.0,True
1,2014-06-15,552278,Smith Plumbing,920000.0,1012000.0,0.10,0.0,True
2,2016-03-29,23477,ACME Industrial,50000.0,62500.0,0.25,0.0,True
3,2015-10-27,24900,Brekke LTD,350000.0,490000.0,0.04,0.0,True
4,2014-02-02,651029,Harbor Co,15000.0,12750.0,-0.15,0.0,False

In [19]:
df.rename(columns={'Start_Date':'date', 'Customer Name':'nome'})

,date,Customer Number,nome,2016,2017,Percent Growth,Jan Units,Active
0,2015-01-10,10002,Quest Industries,125000.0,162500.0,0.30,500.0,True
1,2014-06-15,552278,Smith Plumbing,920000.0,1012000.0,0.10,0.0,True
2,2016-03-29,23477,ACME Industrial,50000.0,62500.0,0.25,0.0,True
3,2015-10-27,24900,Brekke LTD,350000.0,490000.0,0.04,0.0,True
4,2014-02-02,651029,Harbor Co,15000.0,12750.0,-0.15,0.0,False

### 1.7 Modificando o index do Dataframe

##### Definindo um novo Index

In [20]:
df.set_index('Start_Date')

,Customer Number,Customer Name,2016,2017,Percent Growth,Jan Units,Active
Start_Date,,,,,,,
2015-01-10,10002,Quest Industries,125000.0,162500.0,0.30,500.0,True
2014-06-15,552278,Smith Plumbing,920000.0,1012000.0,0.10,0.0,True
2016-03-29,23477,ACME Industrial,50000.0,62500.0,0.25,0.0,True
2015-10-27,24900,Brekke LTD,350000.0,490000.0,0.04,0.0,True
2014-02-02,651029,Harbor Co,15000.0,12750.0,-0.15,0.0,False

In [21]:
df.set_index('Start_Date', inplace=True)

In [22]:
df.head()

,Customer Number,Customer Name,2016,2017,Percent Growth,Jan Units,Active
Start_Date,,,,,,,
2015-01-10,10002,Quest Industries,125000.0,162500.0,0.30,500.0,True
2014-06-15,552278,Smith Plumbing,920000.0,1012000.0,0.10,0.0,True
2016-03-29,23477,ACME Industrial,50000.0,62500.0,0.25,0.0,True
2015-10-27,24900,Brekke LTD,350000.0,490000.0,0.04,0.0,True
2014-02-02,651029,Harbor Co,15000.0,12750.0,-0.15,0.0,False

##### Resetando index atual

In [23]:
df.reset_index(inplace=True)

### 1.8 Ordenação de Dados

In [24]:
df

,Start_Date,Customer Number,Customer Name,2016,2017,Percent Growth,Jan Units,Active
0,2015-01-10,10002,Quest Industries,125000.0,162500.0,0.30,500.0,True
1,2014-06-15,552278,Smith Plumbing,920000.0,1012000.0,0.10,0.0,True
2,2016-03-29,23477,ACME Industrial,50000.0,62500.0,0.25,0.0,True
3,2015-10-27,24900,Brekke LTD,350000.0,490000.0,0.04,0.0,True
4,2014-02-02,651029,Harbor Co,15000.0,12750.0,-0.15,0.0,False

In [25]:
df.sort_values('Start_Date')

,Start_Date,Customer Number,Customer Name,2016,2017,Percent Growth,Jan Units,Active
4,2014-02-02,651029,Harbor Co,15000.0,12750.0,-0.15,0.0,False
1,2014-06-15,552278,Smith Plumbing,920000.0,1012000.0,0.10,0.0,True
0,2015-01-10,10002,Quest Industries,125000.0,162500.0,0.30,500.0,True
3,2015-10-27,24900,Brekke LTD,350000.0,490000.0,0.04,0.0,True
2,2016-03-29,23477,ACME Industrial,50000.0,62500.0,0.25,0.0,True

In [26]:
df.sort_values(by='2017', ascending=False)

,Start_Date,Customer Number,Customer Name,2016,2017,Percent Growth,Jan Units,Active
1,2014-06-15,552278,Smith Plumbing,920000.0,1012000.0,0.10,0.0,True
3,2015-10-27,24900,Brekke LTD,350000.0,490000.0,0.04,0.0,True
0,2015-01-10,10002,Quest Industries,125000.0,162500.0,0.30,500.0,True
2,2016-03-29,23477,ACME Industrial,50000.0,62500.0,0.25,0.0,True
4,2014-02-02,651029,Harbor Co,15000.0,12750.0,-0.15,0.0,False

In [27]:
df.sort_values(by=['Customer Name','2017'])

,Start_Date,Customer Number,Customer Name,2016,2017,Percent Growth,Jan Units,Active
2,2016-03-29,23477,ACME Industrial,50000.0,62500.0,0.25,0.0,True
3,2015-10-27,24900,Brekke LTD,350000.0,490000.0,0.04,0.0,True
4,2014-02-02,651029,Harbor Co,15000.0,12750.0,-0.15,0.0,False
0,2015-01-10,10002,Quest Industries,125000.0,162500.0,0.30,500.0,True
1,2014-06-15,552278,Smith Plumbing,920000.0,1012000.0,0.10,0.0,True

In [28]:
df.sort_values(by=['Customer Name','2017'], ascending=False)

,Start_Date,Customer Number,Customer Name,2016,2017,Percent Growth,Jan Units,Active
1,2014-06-15,552278,Smith Plumbing,920000.0,1012000.0,0.10,0.0,True
0,2015-01-10,10002,Quest Industries,125000.0,162500.0,0.30,500.0,True
4,2014-02-02,651029,Harbor Co,15000.0,12750.0,-0.15,0.0,False
3,2015-10-27,24900,Brekke LTD,350000.0,490000.0,0.04,0.0,True
2,2016-03-29,23477,ACME Industrial,50000.0,62500.0,0.25,0.0,True

### 1.9 Multiindex

In [29]:
# Níveis de Índice
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
# criar uma lista de tuplas com as duas listas
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [30]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [31]:
# Criando um Dataframe
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  2.706850  0.628133
   2  0.907969  0.503826
   3  0.651118 -0.319318
G2 1 -0.848077  0.605965
   2 -2.018168  0.740122
   3  0.528813 -0.589001

In [32]:
df.loc['G1']

          A         B
1  2.706850  0.628133
2  0.907969  0.503826
3  0.651118 -0.319318

In [33]:
df.loc['G2']

          A         B
1 -0.848077  0.605965
2 -2.018168  0.740122
3  0.528813 -0.589001

In [34]:
df.loc['G2'].loc[1:2]

          A         B
1 -0.848077  0.605965
2 -2.018168  0.740122

In [35]:
df.index.names

FrozenList([None, None])

In [36]:
df.index.names = ['Grupo','Número']

In [37]:
df

                     A         B
Grupo Número
G1    1       2.706850  0.628133
      2       0.907969  0.503826
      3       0.651118 -0.319318
G2    1      -0.848077  0.605965
      2      -2.018168  0.740122
      3       0.528813 -0.589001